# validation
! userInfo
loginId.blank=\u30ED\u30B0\u30A4\u30F3ID\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
loginId.invalid=\u30ED\u30B0\u30A4\u30F3ID\u306F\u82F1\u5B57\u30FB\u6570\u5B57\u3092\u305D\u308C\u305E\u308C1\u5B57\u4EE5\u4E0A\u542B\u3080\u30016\u301C20\u5B57\u306E\u534A\u89D2\u82F1\u6570\u5B57\u304A\u3088\u3073\u8A18\u53F7(-_)\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
userName.invalid=\u30E6\u30FC\u30B6\u30FC\u540D\u306F20\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
email.invalid.pattern=\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306E\u5F62\u5F0F\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
email.invalid.size=\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306F255\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
password.blank=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
password.invalid=\u30D1\u30B9\u30EF\u30FC\u30C9\u306F\u82F1\u5B57(\u5927\u6587\u5B57\u30FB\u5C0F\u6587\u5B57)\u30FB\u6570\u5B57\u30FB\u8A18\u53F7\u3092\u305D\u308C\u305E\u308C1\u5B57\u4EE5\u4E0A\u542B\u3080\u30018\u301C32\u5B57\u306E\u534A\u89D2\u82F1\u6570\u5B57\u304A\u3088\u3073\u8A18\u53F7(-_*)\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
password.mismatch=\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
currentPassword.blank=\u73FE\u5728\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002

! action
date.blank=\u65E5\u4ED8\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
contentList.size=\u5185\u5BB9\u306F100\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
memo.size=\u30E1\u30E2\u306F500\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
content.blank=\u5185\u5BB9\u3092\u7A7A\u6B04\u306E\u307E\u307E\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
content.duplicate=\u540C\u3058\u65E5\u306B\u540C\u3058\u5185\u5BB9\u3092\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
date.future=\u672A\u6765\u306E\u6210\u679C\u3092\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
hours.range=\u5B66\u7FD2\u6642\u9593(\u6642\u9593)\u306F0\u301C24\u306E\u534A\u89D2\u82F1\u6570\u5B57\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
minutes.range=\u5B66\u7FD2\u6642\u9593(\u5206)\u306F0\u301C59\u306E\u534A\u89D2\u82F1\u6570\u5B57\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
learning.time.blank=\u5B66\u7FD2\u6642\u9593\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
total.learning.time.exceed=1\u65E5\u306B24\u6642\u9593\u3092\u8D85\u3048\u308B\u5B66\u7FD2\u6642\u9593\u3092\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
title.blank=\u30BF\u30A4\u30C8\u30EB\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
title.size=\u30BF\u30A4\u30C8\u30EB\u306F100\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
content.size=\u5185\u5BB9\u306F500\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
status.blank=\u30C9\u30ED\u30C3\u30D7\u30C0\u30A6\u30F3\u30EA\u30B9\u30C8\u304B\u3089\u9078\u629E\u3057\u3066\u304F\u3060\u3055\u3044\u3002
goal.already.achieved=\u9054\u6210\u6E08\u307F\u306E\u76EE\u6A19\u3092\u65B0\u898F\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
url.size=URL\u306F2083\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002

# exception
duplicate.loginId=\u3053\u306E\u30E6\u30FC\u30B6\u30FCID\u306F\u3059\u3067\u306B\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.email=\u3053\u306E\u30E1\u30FC\u30EB\u30A2\u30C9\u30EC\u30B9\u306F\u3059\u3067\u306B\u4F7F\u7528\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.title=\u3053\u306E\u30BF\u30A4\u30C8\u30EB\u306F\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.goal.title=\u3053\u306E\u30BF\u30A4\u30C8\u30EB\u306E\u76EE\u6A19\u306F\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.memo.title=\u3053\u306E\u30BF\u30A4\u30C8\u30EB\u306E\u30E1\u30E2\u306F\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.article.title=\u3053\u306E\u30BF\u30A4\u30C8\u30EB\u306E\u8A18\u4E8B\u30B9\u30C8\u30C3\u30AF\u306F\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002
duplicate.url=\u3053\u306EURL\u306E\u8A18\u4E8B\u30B9\u30C8\u30C3\u30AF\u306F\u3059\u3067\u306B\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u3059\u3002

# alert
login.failure=\u30ED\u30B0\u30A4\u30F3ID \u307E\u305F\u306F \u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
login.failure.hint=\u534A\u89D2\u5165\u529B\u306B\u306A\u3063\u3066\u3044\u308B\u3053\u3068\u3092\u3054\u78BA\u8A8D\u304F\u3060\u3055\u3044\u3002
password.incorrect=\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002
password.change.notice1=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5909\u66F4\u3059\u308B\u3068\u30ED\u30B0\u30A2\u30A6\u30C8\u3055\u308C\u3001\u30ED\u30B0\u30A4\u30F3\u753B\u9762\u306B\u623B\u308A\u307E\u3059\u3002
password.change.notice2=\u65B0\u3057\u3044\u30D1\u30B9\u30EF\u30FC\u30C9\u3067\u518D\u5EA6\u30ED\u30B0\u30A4\u30F3\u3057\u76F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
task.edit.notice1=\u5185\u5BB9\u3092\u7A7A\u6B04\u306E\u307E\u307E\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
task.edit.notice2=\u767B\u9332\u6E08\u307F\u30C7\u30FC\u30BF\u3092\u524A\u9664\u3059\u308B\u5834\u5408\u306F\u30B4\u30DF\u7BB1\u306B\u30C1\u30A7\u30C3\u30AF\u3092\u5165\u308C\u3066\u304F\u3060\u3055\u3044\u3002
tag.input.notice=\u30BF\u30B0\u306F\u982D\u306B\u30CF\u30C3\u30B7\u30E5(#)\u3092\u3064\u3051\u3001\u30B3\u30F3\u30DE(,)\u3067\u533A\u5207\u3063\u3066\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
goal.edit.notice1=\u30BF\u30A4\u30C8\u30EB\u30FB\u5185\u5BB9\u30FB\u9054\u6210\u72B6\u6CC1\u3092\u7A7A\u6B04\u306E\u307E\u307E\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
goal.edit.notice2=\u65B0\u898F\u767B\u9332\u6642\u70B9\u3067\u9054\u6210\u3057\u3066\u3044\u308B\u76EE\u6A19\u3092\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
memo.notice=\u203B \u753B\u50CF\u3092\u542B\u3080\u5834\u5408\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u306E\u89B3\u70B9\u304B\u3089\u76F4\u63A5\u8868\u793A\u305B\u305A\u3001\u30EA\u30F3\u30AF\u3067\u4EE3\u66FF\u3057\u3066\u3044\u307E\u3059
memo.edit.notice1=\u30BF\u30A4\u30C8\u30EB\u30FB\u5185\u5BB9\u3092\u7A7A\u6B04\u306E\u307E\u307E\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
article.edit.notice1=\u30BF\u30A4\u30C8\u30EB\u3092\u7A7A\u6B04\u306E\u307E\u307E\u767B\u9332\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
guest.user.alert=\u30B2\u30B9\u30C8\u30E6\u30FC\u30B6\u30FC\u3068\u3057\u3066\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u3044\u308B\u305F\u3081\u3001\u30E6\u30FC\u30B6\u30FC\u60C5\u5831\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002

# input-hint
loginId.placeholder=6\u301C20\u5B57\u306E\u534A\u89D2\u82F1\u6570\u5B57\u304A\u3088\u3073\u8A18\u53F7\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
loginId.input.hint1=\u203B \u82F1\u5B57\u30FB\u6570\u5B57\u3092\u54041\u5B57\u4EE5\u4E0A\u542B\u3080\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\uFF08\u5927\u6587\u5B57\u30FB\u5C0F\u6587\u5B57\u306F\u533A\u5225\u3055\u308C\u307E\u3059\uFF09
loginId.input.hint2=\u203B \u8A18\u53F7\u306F\u30CF\u30A4\u30D5\u30F3(-)\u3001\u30A2\u30F3\u30C0\u30FC\u30D0\u30FC(_)\u304C\u4F7F\u7528\u3067\u304D\u307E\u3059
userName.placeholder=20\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
email.placeholder=@\u3092\u542B\u3080\u5F62\u5F0F\u3067\u3001254\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
password.placeholder=8\u301C32\u5B57\u306E\u534A\u89D2\u82F1\u6570\u5B57\u304A\u3088\u3073\u8A18\u53F7\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
password.input.hint1=\u203B \u82F1\u5B57(\u5927\u6587\u5B57\u30FB\u5C0F\u6587\u5B57)\u30FB\u6570\u5B57\u30FB\u8A18\u53F7\u3092\u54041\u5B57\u4EE5\u4E0A\u542B\u3080\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059
password.input.hint2=\u203B \u8A18\u53F7\u306F\u30CF\u30A4\u30D5\u30F3(-)\u3001\u30A2\u30F3\u30C0\u30FC\u30D0\u30FC(_)\u3001\u30A2\u30B9\u30BF\u30EA\u30B9\u30AF(*)\u304C\u4F7F\u7528\u3067\u304D\u307E\u3059
confirmPassword.placeholder=\u78BA\u8A8D\u306E\u305F\u3081\u3001\u3082\u3046\u4E00\u5EA6\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
currentPassword.placeholder=\u73FE\u5728\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
login.placeholder=\u534A\u89D2\u82F1\u6570\u5B57\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
task.content.placeholder=100\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
hours.placeholder=0\u301C24\u306E\u534A\u89D2\u6570\u5B57
minutes.placeholder=0\u301C59\u306E\u534A\u89D2\u6570\u5B57
done.memo.placeholder=500\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
title.placeholder=100\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
goal.content.placeholder=500\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044
article.memo.placeholder=500\u5B57\u4EE5\u5185\u3067\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044

# dialog
change.confirm=\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5909\u66F4\u3059\u308B\u3068\u30ED\u30B0\u30A2\u30A6\u30C8\u3055\u308C\u3001\u30ED\u30B0\u30A4\u30F3\u753B\u9762\u306B\u623B\u308A\u307E\u3059\u3002\n\u5909\u66F4\u3057\u307E\u3059\u304B\uFF1F\uFF08\u3053\u306E\u51E6\u7406\u306F\u5143\u306B\u623B\u305B\u307E\u305B\u3093\uFF09
task.delete.confirm=\u3053\u306E\u65E5\u306E{0}\u30EA\u30B9\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u304B\uFF1F\uFF08\u3053\u306E\u51E6\u7406\u306F\u5143\u306B\u623B\u305B\u307E\u305B\u3093\uFF09
action.delete.confirm=\u3053\u306E{0}\u3092\u524A\u9664\u3057\u307E\u3059\u304B\uFF1F\uFF08\u3053\u306E\u51E6\u7406\u306F\u5143\u306B\u623B\u305B\u307E\u305B\u3093\uFF09
delete.confirm=\u30B4\u30DF\u7BB1\u306B\u30C1\u30A7\u30C3\u30AF\u304C\u5165\u3063\u3066\u3044\u308B\u30C7\u30FC\u30BF\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002\n\u4FDD\u5B58\u3057\u307E\u3059\u304B\uFF1F\uFF08\u3053\u306E\u51E6\u7406\u306F\u5143\u306B\u623B\u305B\u307E\u305B\u3093\uFF09
delete.account=\u30A2\u30AB\u30A6\u30F3\u30C8\u304A\u3088\u3073\u767B\u9332\u30C7\u30FC\u30BF\u3092\u3059\u3079\u3066\u524A\u9664\u3057\u3066\u30ED\u30B0\u30A2\u30A6\u30C8\u3057\u307E\u3059\u3002\n\u524A\u9664\u3057\u3066\u3088\u308D\u3057\u3044\u3067\u3059\u304B\uFF1F\uFF08\u3053\u306E\u51E6\u7406\u306F\u5143\u306B\u623B\u305B\u307E\u305B\u3093\uFF09

# success
signup.success=\u767B\u9332\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002\u30ED\u30B0\u30A4\u30F3\u3057\u3066\u304F\u3060\u3055\u3044\u3002
userInfo.edit.success=\u30E6\u30FC\u30B6\u30FC\u767B\u9332\u60C5\u5831\u304C\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
password.change.success=\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002\u30ED\u30B0\u30A4\u30F3\u3057\u76F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
register.success=\u767B\u9332\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
update.success=\u66F4\u65B0\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002
delete.success=\u524A\u9664\u304C\u5B8C\u4E86\u3057\u307E\u3057\u305F\u3002

# awesome
awesome.word=\u3048\u3089\u3044\uFF01
todo.awesome=\u3084\u308B\u3053\u3068\u3092\u6C7A\u3081\u3066
done.awesome=\u5B9F\u884C\u3067\u304D\u3066
goal.awesome=\u76EE\u6A19\u3092\u7ACB\u3066\u3066
achieved.awesome=\u9054\u6210\u3067\u304D\u3066
memo.awesome=\u30E1\u30E2\u306B\u6B8B\u3057\u3066
article.awesome=\u60C5\u5831\u3092\u96C6\u3081\u3066
finished.awesome=\u77E5\u8B58\u3092\u6DF1\u3081\u3066

# others
unregistered.task=\u3053\u306E\u65E5\u306E{0}\u30EA\u30B9\u30C8\u306F\u307E\u3060\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
unregistered.action=\u307E\u3060{0}\u304C\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
register.first.action=\u6700\u521D\u306E{0}\u3092\u767B\u9332\u3059\u308B
register.additional.action={0}\u3092\u8FFD\u52A0\u3059\u308B
no.learning.record=\u5B66\u7FD2\u8A18\u9332\u304C\u307E\u3060\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093
no.awesome.point=\u3048\u3089\u3044\uFF01\u30DD\u30A4\u30F3\u30C8\u304C\u307E\u3060\u3042\u308A\u307E\u305B\u3093

# error
not.found.title=Not Found!
not.found=\u30DA\u30FC\u30B8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
return.guide=\u524D\u306E\u30DA\u30FC\u30B8\u306B\u623B\u308B\u304B\u3001\u30B5\u30A4\u30C9\u30E1\u30CB\u30E5\u30FC\u304B\u3089\u9078\u3093\u3067\u79FB\u52D5\u3057\u3066\u304F\u3060\u3055\u3044\u3002
unexpected.error.title=Unexpected Error!
unexpected.error=\u4E88\u671F\u305B\u306C\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
reconnect.guide=\u3057\u3070\u3089\u304F\u5F85\u3063\u3066\u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3057\u76F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
access.denied.title=Access Denied!
access.denied=\u3053\u306E\u30DA\u30FC\u30B8\u306B\u306F\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002